Revit 2024 API
ParameterSet Class
A set that contains parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class ParameterSet : APIObject,
	IEnumerable
Visual Basic
Public Class ParameterSet _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class ParameterSet : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.ParameterSet
See Also
ParameterSet Members
Autodesk.Revit.DB Namespace